// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.//

//Console.Write("Введите первое число: ");
//int a = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите второе число: ");
//int b = Convert.ToInt32(Console.ReadLine());

//if(a<b){
//    Console.WriteLine("первое число меньше, второе больше");
//}
//else{
//    Console.WriteLine("первое число больше, второе меньше");
//}


//Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.//

// Console.Write("Введите первое число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int b = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите третье число: ");
// int c = Convert.ToInt32(Console.ReadLine());
// int max = a;

// if (b > max) 
// {
//    max = b;
// }
// if (c > max)
// {
//    max = c;
// }
// Console.WriteLine( max );


// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).


// Console.Write("Введите число: ");
// int a = Convert.ToInt32(Console.ReadLine());

// if ( a%2 == 0)
// {
//     Console.WriteLine( "четное" );
// }
// else
// {
//     Console.WriteLine( "нечетное" );
// } 
 

// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.